Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/atdf/PIC32CM5164LS00100.atdf
        <register name="OPAMPCTRL2" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="OPAMP2 Control">
          <bitfield name="ENABLE" caption="Operational Amplifier Enable" mask="0x2"/>
          <bitfield name="ANAOUT" caption="Analog Output" mask="0x4"/>
          <bitfield name="BIAS" caption="Bias Selection" mask="0x18" values="OPAMP_OPAMPCTRL__BIAS"/>
          <bitfield name="RES2VCC" caption="Resistor ladder To VCC" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x100"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x200"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x1C00" values="OPAMP_OPAMPCTRL2__RES1MUX"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0xE000" values="OPAMP_OPAMPCTRL__POTMUX"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0xF0000" values="OPAMP_OPAMPCTRL2__MUXPOS"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0xF00000" values="OPAMP_OPAMPCTRL0__MUXNEG"/>
        </register>
        <register name="RESCTRL" offset="0x10" rw="RW" size="1" initval="0x00" caption="Resister Control">
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x1"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x2"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x4" values="OPAMP_RESCTRL__RES1MUX"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0x38" values="OPAMP_RESCTRL__POTMUX"/>
          <bitfield name="REFBUFLEVEL" caption="Reference output voltage level select" mask="0xC0" values="OPAMP_RESCTRL__REFBUFLEVEL"/>
        </register>
      </register-group>
      <value-group name="OPAMP_OPAMPCTRL__BIAS">
        <value name="MODE0" caption="Minimum current consumption, but the slowest mode" value="0x0"/>
        <value name="MODE1" caption="Low current consumption, slow speed" value="0x1"/>
        <value name="MODE2" caption="High current consumption, fast speed" value="0x2"/>
        <value name="MODE3" caption="Maximum current consumption, but the fastest mode" value="0x3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL0__RES1MUX">
        <value name="OA0POS" caption="OPAMP0 Positive Input" value="0x0"/>
        <value name="OA0NEG" caption="OPAMP0 Negative Input" value="0x1"/>
        <value name="DAC_REFBUF" caption="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" value="0x2"/>
        <value name="AVSS" caption="Ground" value="0x3"/>
        <value name="RG_CONN" caption="RG_CONN" value="0x4"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL1__RES1MUX">
        <value name="OA1POS" caption="OPAMP1 Positive Input" value="0x0"/>
        <value name="OA1NEG" caption="OPAMP1 Negative Input" value="0x1"/>
        <value name="OA0OUT" caption="OPAMP0 Output" value="0x2"/>
        <value name="AVSS" caption="Ground" value="0x3"/>
        <value name="RG_CONN" caption="RG_CONN" value="0x4"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL2__RES1MUX">
        <value name="OA2POS" caption="OPAMP2 Positive Input" value="0x0"/>
        <value name="OA2NEG" caption="OPAMP2 Negative Input" value="0x1"/>
        <value name="OA1OUT" caption="OPAMP1 Output" value="0x2"/>
        <value name="AVSS" caption="Ground" value="0x3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL__POTMUX">
        <value name="14R_2R" caption="R1 = 14R, R2 = 2R" value="0x0"/>
        <value name="12R_4R" caption="R1 = 12R, R2 = 4R" value="0x1"/>
        <value name="8R_8R" caption="R1 = 8R, R2 = 8R" value="0x2"/>
        <value name="6R_10R" caption="R1 = 6R, R2 = 10R" value="0x3"/>
        <value name="4R_12R" caption="R1 = 4R, R2 = 12R" value="0x4"/>
        <value name="3R_13R" caption="R1 = 3R, R2 = 13R" value="0x5"/>
        <value name="2R_14R" caption="R1 = 2R, R2 = 14R" value="0x6"/>
        <value name="R_15R" caption="R1 = 1R, R2 = 15R" value="0x7"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL0__MUXPOS">
        <value name="OA0POS" caption="OPAMP0 Positive Input" value="0x0"/>
        <value name="OA0TAP" caption="OPAMP0 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="REFERENCE or DAC VOUT0 Output" value="0x2"/>
        <value name="AVSS" caption="Ground" value="0x3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL1__MUXPOS">
        <value name="OA1POS" caption="OPAMP1 Positive Input" value="0x0"/>
        <value name="OA1TAP" caption="OPAMP1 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="REFERENCE or DAC VOUT0 Output" value="0x2"/>
        <value name="AVSS" caption="Ground" value="0x3"/>
        <value name="OA0OUT" caption="OPAMP0 output" value="0x4"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL2__MUXPOS">
        <value name="OA2POS" caption="OPAMP2 Positive Input" value="0x0"/>
        <value name="OA2TAP" caption="OPAMP2 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="REFERENCE or DAC VOUT0 Output" value="0x2"/>
        <value name="AVSS" caption="Ground" value="0x3"/>
        <value name="OA1OUT" caption="OPAMP1 Output" value="0x4"/>
        <value name="OA0POS" caption="OPAMP0 Positive Input" value="0x5"/>
        <value name="OA1POS" caption="OPAMP1 Positive Input" value="0x6"/>
        <value name="OA0TAP" caption="OPAMP0 Resistor Ladder Taps" value="0x7"/>
        <value name="RES3TAP" caption="RES3TAP Potentiometer" value="0x8"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL0__MUXNEG">
        <value name="OA0NEG" caption="OPAMP0 Negative Input" value="0x0"/>
        <value name="OA0TAP" caption="OPAMP0 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" value="0x2"/>
        <value name="OA0OUT" caption="OPAMP0 Output" value="0x3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL1__MUXNEG">
        <value name="OA1NEG" caption="OPAMP1 Negative Input" value="0x0"/>
        <value name="OA1TAP" caption="OPAMP1 Resistor ladder taps" value="0x1"/>
        <value name="DAC_REFBUF" caption="DAC VOUT0 or OPAMP Reference Output Voltage (REFBUF)" value="0x2"/>
        <value name="OA1OUT" caption="OPAMP1 Output" value="0x3"/>
      </value-group>
